app/controllers/api/folders_controller.rb

  def destroy
    @folder = Folder.find(params[:id])
    @folder.destroy!
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 7]]

  def show
    @folder = Folder.includes(recipes: [:reviews, :author, :folders]).find(params[:id])
    @folder.recipes.each do |recipe|
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (2)
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IN (2)

  def index
    @folders = current_user.folders.includes(recipes: [:reviews, :author, :folders])
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" IN (5, 2, 4, 8, 1, 11)
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (2)