app/controllers/api/folder_recipes_controller.rb

  def create
    folder = Folder.find(params[:folder_id])
    @folder_recipe = folder.folder_recipes.new(folder_recipe_params)
    if @folder_recipe.save
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT 1  [["id", 9]]
INSERT INTO "folder_recipes" ("recipe_id", "folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 1], ["folder_id", 5], ["created_at", "2015-09-20 00:07:05.552415"], ["updated_at", "2015-09-20 00:07:05.552415"]]