app/controllers/api/recipes_controller.rb

  def create
    @recipe = current_user.authored_recipes.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("title", "servings", "active_time", "total_time", "description", "ingredients", "instructions", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def show
    @recipe = Recipe.includes(:author, :folders, reviews: [:author]).find(params[:id])
    @recipe.retrieve_review_summary
    @folders = @recipe.folders.where(owner_id: current_user.id)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "folders".* FROM "folders" WHERE "folders"."id" IN (11)
SELECT  "folders".* FROM "folders" INNER JOIN "folder_recipes" ON "folders"."id" = "folder_recipes"."folder_id" WHERE "folder_recipes"."recipe_id" = $1 AND "folders"."owner_id" = $2  ORDER BY "folders"."id" ASC LIMIT 1  [["recipe_id", 3], ["owner_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (3)

  def index
    @recipes = current_user.authored_recipes.includes(:reviews, :folders)
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" IN (5, 2, 4, 8)
SELECT "recipes".* FROM "recipes" WHERE "recipes"."author_id" = $1  [["author_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (1)