app/controllers/api/reviews_controller.rb

  def index
    @reviews = current_user.authored_reviews.includes(:recipe)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."author_id" = $1  [["author_id", 1]]