app/views/api/folders/index.json.jbuilder

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 2]]
---
    json.photo_url asset_path(recipe.photo.url(:original))
    json.review_count recipe.reviews.count